# HasResolutions Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
FailureMessage..::..HasResolutions Method
FailureMessage Class See Also
---
Checks if the failure has any resolutions.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool HasResolutions()
```

Visual Basic
---
```text
Public Function HasResolutions As Boolean
```

Visual C++
---
```text
public:
bool HasResolutions()
```

# ### Return Value
True if the failure has any resolutions, false otherwise.
# See Also
FailureMessage Class
Autodesk.Revit.DB Namespace